; domain
(define (domain depots)
  (:requirements :typing :strips)
  (:types
    place - object
    depot distributor - place
    locatable - object
    truck hoist surface - locatable
    pallet crate - surface
  )

  (:predicates
    (at ?obj - locatable ?p - place)
    (on ?c - crate ?s - surface)
    (in ?c - crate ?t - truck)
    (lifting ?h - hoist ?c - crate)
    (available ?h - hoist)
    (clear ?s - surface)
  )

  (:action drive
    :parameters (?t - truck ?from - place ?to - place)
    :precondition (at ?t ?from)
    :effect (and
      (not (at ?t ?from))
      (at ?t ?to)
    )
  )

  (:action lift
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?c ?p)
      (at ?s ?p)
      (on ?c ?s)
      (clear ?c)
      (available ?h)
    )
    :effect (and
      (not (at ?c ?p))
      (not (available ?h))
      (not (on ?c ?s))
      (not (clear ?c))
      (lifting ?h ?c)
      (clear ?s)
    )
  )

  (:action drop
    :parameters (?h - hoist ?c - crate ?s - surface ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?s ?p)
      (clear ?s)
      (lifting ?h ?c)
    )
    :effect (and
      (at ?c ?p)
      (available ?h)
      (on ?c ?s)
      (not (lifting ?h ?c))
      (not (clear ?s))
      (clear ?c)
    )
  )

  (:action load
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (lifting ?h ?c)
    )
    :effect (and
      (not (lifting ?h ?c))
      (in ?c ?t)
      (available ?h)
    )
  )

  (:action unload
    :parameters (?h - hoist ?c - crate ?t - truck ?p - place)
    :precondition (and
      (at ?h ?p)
      (at ?t ?p)
      (available ?h)
      (in ?c ?t)
    )
    :effect (and
      (not (available ?h))
      (not (in ?c ?t))
      (lifting ?h ?c)
    )
  )
)

; problem
(define (problem depot-6-3-2-9-9-4) (:domain depots)
(:objects
	depot0 depot1 depot2 depot3 depot4 depot5 - Depot
	distributor0 distributor1 distributor2 - Distributor
	truck0 truck1 - Truck
	pallet0 pallet1 pallet2 pallet3 pallet4 pallet5 pallet6 pallet7 pallet8 - Pallet
	crate0 crate1 crate2 crate3 - Crate
	hoist0 hoist1 hoist2 hoist3 hoist4 hoist5 hoist6 hoist7 hoist8 - Hoist)
(:init
	(at pallet0 depot0)
	(clear pallet0)
	(at pallet1 depot1)
	(clear crate2)
	(at pallet2 depot2)
	(clear pallet2)
	(at pallet3 depot3)
	(clear pallet3)
	(at pallet4 depot4)
	(clear pallet4)
	(at pallet5 depot5)
	(clear pallet5)
	(at pallet6 distributor0)
	(clear crate3)
	(at pallet7 distributor1)
	(clear crate1)
	(at pallet8 distributor2)
	(clear crate0)
	(at truck0 depot4)
	(at truck1 depot4)
	(at hoist0 depot0)
	(available hoist0)
	(at hoist1 depot1)
	(available hoist1)
	(at hoist2 depot2)
	(available hoist2)
	(at hoist3 depot3)
	(available hoist3)
	(at hoist4 depot4)
	(available hoist4)
	(at hoist5 depot5)
	(available hoist5)
	(at hoist6 distributor0)
	(available hoist6)
	(at hoist7 distributor1)
	(available hoist7)
	(at hoist8 distributor2)
	(available hoist8)
	(at crate0 distributor2)
	(on crate0 pallet8)
	(at crate1 distributor1)
	(on crate1 pallet7)
	(at crate2 depot1)
	(on crate2 pallet1)
	(at crate3 distributor0)
	(on crate3 pallet6)
)

(:goal (and
		(on crate1 pallet2)
		(on crate2 crate1)
		(on crate3 pallet7)
	)
))

; plan
1. (lift hoist6 crate3 pallet6 distributor0)
   deleted: (at crate3 distributor0) (available hoist6) (on crate3 pallet6) (clear crate3)
   added: (lifting hoist6 crate3) (clear pallet6)
   goals met: 0 of 3
2. (drive truck0 depot4 distributor0)
   deleted: (at truck0 depot4)
   added: (at truck0 distributor0)
   goals met: 0 of 3
3. (load hoist6 crate3 truck0 distributor0)
   deleted: (lifting hoist6 crate3)
   added: (in crate3 truck0) (available hoist6)
   goals met: 0 of 3
4. (lift hoist7 crate1 pallet7 distributor1)
   deleted: (at crate1 distributor1) (available hoist7) (on crate1 pallet7) (clear crate1)
   added: (lifting hoist7 crate1) (clear pallet7)
   goals met: 0 of 3
5. (drive truck0 distributor0 distributor1)
   deleted: (at truck0 distributor0)
   added: (at truck0 distributor1)
   goals met: 0 of 3
6. (load hoist7 crate1 truck0 distributor1)
   deleted: (lifting hoist7 crate1)
   added: (in crate1 truck0) (available hoist7)
   goals met: 0 of 3
7. (unload hoist7 crate3 truck0 distributor1)
   deleted: (available hoist7) (in crate3 truck0)
   added: (lifting hoist7 crate3)
   goals met: 0 of 3
8. (lift hoist1 crate2 pallet1 depot1)
   deleted: (at crate2 depot1) (available hoist1) (on crate2 pallet1) (clear crate2)
   added: (lifting hoist1 crate2) (clear pallet1)
   goals met: 0 of 3
9. (drive truck0 distributor1 depot1)
   deleted: (at truck0 distributor1)
   added: (at truck0 depot1)
   goals met: 0 of 3
10. (load hoist1 crate2 truck0 depot1)
   deleted: (lifting hoist1 crate2)
   added: (in crate2 truck0) (available hoist1)
   goals met: 0 of 3
11. (drop hoist7 crate3 pallet7 distributor1)
   deleted: (lifting hoist7 crate3) (clear pallet7)
   added: (at crate3 distributor1) (available hoist7) (on crate3 pallet7) (clear crate3)
   goals met: 1 of 3
12. (drive truck0 depot1 depot2)
   deleted: (at truck0 depot1)
   added: (at truck0 depot2)
   goals met: 1 of 3
13. (unload hoist2 crate1 truck0 depot2)
   deleted: (available hoist2) (in crate1 truck0)
   added: (lifting hoist2 crate1)
   goals met: 1 of 3
14. (drop hoist2 crate1 pallet2 depot2)
   deleted: (lifting hoist2 crate1) (clear pallet2)
   added: (at crate1 depot2) (available hoist2) (on crate1 pallet2) (clear crate1)
   goals met: 2 of 3
15. (unload hoist2 crate2 truck0 depot2)
   deleted: (available hoist2) (in crate2 truck0)
   added: (lifting hoist2 crate2)
   goals met: 2 of 3
16. (drop hoist2 crate2 crate1 depot2)
   deleted: (lifting hoist2 crate2) (clear crate1)
   added: (at crate2 depot2) (available hoist2) (on crate2 crate1) (clear crate2)
   goals met: 3 of 3
